LedgerHQ/nanos-nonsecure-firmware/build/stm32f042_nanos_seproxyhal/src/GLO091_SSD1306_screen.c

#include "stm32f0xx_hal.h"
#include "stm32f0xx_hal_gpio.h"

// for varargs support in printf
#include <stdarg.h>
#include <string.h>

#include "bagl.h"

#ifdef HAVE_GLO091
// invert to display on a negative polarized screen
//#define HAVE_GLO091_BLACK_ON_WHITE

// SSD1306 is paginated a byte send to the device is a vertical slice of 8 bits of bitmap. lsb is the lower y.

// --------------------------------------------------------------------------------------
// Definitions
// -------------------------------------------------------------------------------------- 

#define ICON_WIDTH 0
#define MIN(x,y) ((x)<(y)?(x):(y))
#define MAX(x,y) ((x)>(y)?(x):(y))
#define U2BE(buf, off) ((((buf)[off]&0xFF)<<8) | ((buf)[off+1]&0xFF) )
#define U4BE(buf, off) ((U2BE(buf, off)<<16) | (U2BE(buf, off+2)&0xFFFF))

// framebuffer
#define SCREEN_HEIGHT 32
#define SCREEN_WIDTH 128
char screen_framebuffer[(SCREEN_WIDTH*SCREEN_HEIGHT)/8];
unsigned int screen_changed; // to avoid screen update for nothing

#ifdef HAVE_PRINTF
char newline_requested = 0;
unsigned char current_x = 0;
#define PRINTF_ZONE_HEIGHT (32)
#define PRINTF_FONT_HEIGHT 8
#define PRINTF_FONT_WIDTH 5
#define PRINTF_FONT_ID BAGL_FONT_LUCIDA_CONSOLE_8
#define PRINTF_LINE_CHAR_LENGTH (SCREEN_WIDTH/PRINTF_FONT_WIDTH)
#define PRINTF_LINE_COUNT (PRINTF_ZONE_HEIGHT/PRINTF_FONT_HEIGHT)
unsigned char screen_charbuffer[PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT];
#endif // HAVE_PRINTF


//#define REG_SET(reg, mask, value) reg = ((reg) & ~mask) | value 
void REG_SET(volatile unsigned int * reg, unsigned int pin, unsigned int value) {
  volatile unsigned int v = 1+pin;
  *reg = (*reg & ~(1<<pin)) | (value<<pin); 
}
#define BB_OUT(port, pin, value) REG_SET(&(port)->ODR, pin, value) 
//#define BB_OUT(port, pin, value) REG_SET((port)->ODR, pin, value) 

#define DISP_PWR(x)    // BB_OUT(GPIOA, 5, x)
/* F042
SPI_SCK =    PA5
SPI_MOSI = PA7
Disp_Reset  PA2
Disp_CS         PA1
Disp_DC        PA0
*/

#include "seproxyhal_protocol.h"

#define DISP_NCS(x)    BB_OUT(GPIOA, 1, x) // BB_OUT(GPIOA, 6, x)
#define DISP_NRST(x)   BB_OUT(GPIOA, 2, x) // BB_OUT(GPIOA, 7, x)
#define DISP_DC(x)     BB_OUT(GPIOA, 0, x) // BB_OUT(GPIOB, 6, x) 
#define DISP_D6_SCL(x) BB_OUT(GPIOA, 5, x) // BB_OUT(GPIOC, 7, x)
#define DISP_D7_SI(x)  BB_OUT(GPIOA, 7, x) // BB_OUT(GPIOA, 9, x)

void screen_init_pins(void) {
  GPIO_InitTypeDef GPIO_InitStruct;

  // configure GPIO  
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_5|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  
  /*
  // configure GPIO  
  GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  
  GPIO_InitStruct.Pin = GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  */
}

void screen_poweroff(void)
{
  /*
  GPIO_InitTypeDef GPIO_InitStruct;
 
  // configure GPIO  
  GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MOf042 test screen (low clockDE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
  
  GPIO_InitStruct.Pin = GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  */
}

void lcd_data(unsigned char control_DATA, unsigned char d) {
  unsigned char c=8;
  // set command
  DISP_DC(control_DATA);
  // activate the data interface
  DISP_NCS(0);
  // msb to lsb bit transfer
  while(c--) {
    // prepare the clock
    DISP_D6_SCL(0);
    // output the line bit value
    volatile unsigned int bit_value = (d & 0x80);
    DISP_D7_SI( (bit_value)?1:0);
    // raise the clock
    DISP_D6_SCL(1);
    // prepare next bit
    d <<= 1;
  }
  // low clock
  DISP_D6_SCL(0);
  // deactivate the data interface
  DISP_NCS(1);
  // disable A0 (just in case)
  DISP_DC(0);
}
        
void lcd_control(unsigned char control)
{
  lcd_data(0, control);
}
        
void lcd_write(char data)
{
  lcd_data(1, data);
}



const unsigned char screen_init_commands[] = {
  0xAE,              // Display off

  0x00,              // <- column address low = 0
  0x10,              // <- column address high = 0
  0x00,              // <- row address low = 0
  0xB0,              // <- page address = 0
  0x81,              // <- Contract control
  0x80,              // Max contrast 256, orig 128

  0xA0,              // <- ADC Direction 0-127
  //0xA1,              // <- ADC Direction 127-0

  0xA6,              // <- Normal display
  0xA8,              // Multiplex ratio 
  0x1F,              // duty = 1/32
  0xC0,              // <- SHL Direction 0-31
  //0xC8,              // <- SHL Direction 31-0
  0xD3,              // Set display offset
  0x00,              // 0
  0xD9,              // set pre-charge period
  0x1F,              // 
  0xDA,              // set com pins
  0x00,
  0xDB,              // set vcomh
  0x40,
  0x8D,              // set charge pump enable
  0x14,              
  //0xAF,              // <- turn display on
  0xA4,              // <- Display all points to OFF
  0x2E,
  0x21,
  0x0,  // first column
  0x7F, // last column
  0x22,
  0x0, // first page
  0x3, // last page
  0x40, // initial line
/*
  0xD5, // set refresh clock
  0xF0, // max freq, divide ratio 1
*/
  

  // 0xC0,              // <- SHL Direction 0-31
  // 0xA7,              // <- Reverse display
};

unsigned int screen_animation_ongoing;
void screen_init(unsigned char reinit)
{      
  unsigned int i; 

