LedgerHQ/nanos-nonsecure-firmware/build/stm32f042_nanos_seproxyhal/src/GLO091_SSD1306_screen.c
  screen_animation_ongoing = 0;

}

unsigned int screen_inverted;
unsigned int screen_angle;
unsigned int screen_luminosity;

void screen_invert(unsigned int inverted) {
  screen_inverted = inverted;
}

void screen_rotation(unsigned int degree) {
  screen_angle = degree;
}

void screen_brightness(uint8_t percentage) {
  screen_luminosity = percentage;
}

/*-------------
refresh the screen, need to be called by application every time the screen's content changes
this method is screen dependent, as it depends on the technology and transport.
--------------*/
void screen_update(void)
{
  unsigned int _x;
  unsigned int _y;

/*
  unsigned int it_dis;
  
  __asm volatile ("mrs %0, PRIMASK":"=r"(it_dis));
  __asm volatile ("cpsid i");
*/  
  if (screen_changed /*&& ! screen_animation_ongoing*/) {
    
    if (screen_inverted) {
        lcd_control(0xA7);
    }
    else {
        lcd_control(0xA6);
    }
    switch(screen_angle) {
        default:
        case 0:
        lcd_control(0xC0);              // <- SHL Direction 0-31
        lcd_control(0xA0);              // <- ADC Direction 0-127
        break;
        case 180:
        lcd_control(0xC8);              // <- SHL Direction 31-0
        lcd_control(0xA1);              // <- ADC Direction 127-0
        break;
    }
    lcd_control(0x81); // <- Contract control
    lcd_control(screen_luminosity*255UL/100UL); // level value
      
    // flush the char buffer into the driver and update the screen
    for (_y=0; _y<(SCREEN_HEIGHT/8); _y++) {
        lcd_control(0xB0|_y);              // <- page address
        for (_x=0; _x<SCREEN_WIDTH; _x++) {
            lcd_write(screen_framebuffer[_y*SCREEN_WIDTH+_x]);
        }
    }
    screen_changed = 0;
  }
  
/*
  // reenable it only if enabled when entering
  if (!it_dis) {
    __asm volatile ("cpsie i");   
  }
*/
}

void screen_animate(unsigned int animation_kind, unsigned char* parameters) {
  unsigned int _x,_y,ystep,_ymin,_ymax;
  unsigned int it_dis;
  switch (animation_kind) {
      case SEPROXYHAL_TAG_SCREEN_ANIMATION_STATUS_VERTICAL_SPLIT_SLIDE: {


        //screen_update();
        
/*
  __asm volatile ("mrs %0, PRIMASK":"=r"(it_dis));
  __asm volatile ("cpsid i");

  screen_animation_ongoing = 1;
  
  if (!it_dis) {
    __asm volatile ("cpsie i");   
  }
*/     
        // blank screen
        for (_y=0; _y<(SCREEN_HEIGHT/8); _y++) {
            lcd_control(0xB0|_y);              // <- page address
            for (_x=0; _x<SCREEN_WIDTH; _x++) {
                lcd_write(0);
            }
        }
        
        // decode parameters
        unsigned int ysplit = U2BE(parameters, 0);
        unsigned int duration = U2BE(parameters, 2);
  
#define YSPLIT ysplit //19L
#define ANIM_DURATION_MS duration // 150
        extern unsigned int uwTick;
        unsigned int start_ms = uwTick;
        unsigned int up_last_y = -1;
        unsigned int up_last_rshift=0;
        unsigned int up_last_mask=0;
        while(uwTick < start_ms + ANIM_DURATION_MS) {
#define DN_YSPLIT (YSPLIT)

            unsigned int dn_last_y=0;
            unsigned int dn_last_rshift=0;
            unsigned int dn_last_mask=0;
  


            // part with y<ysplit is slided with a +dy speed
#define DN_YSPLIT (YSPLIT)
            ystep = (DN_YSPLIT)*(uwTick-start_ms)/ANIM_DURATION_MS;
            _ymax = (ystep/8); 
            // number of page of 8 lines to be modified for the current step
            for (_y=0; _y<=_ymax; _y++) { 
                lcd_control(0xB0|_y);              // <- page address
                unsigned int src_y = DN_YSPLIT/8+1/*(UP_YSPLIT%8?1:0)*/+(_y-_ymax-1);
                unsigned int idx = src_y*SCREEN_WIDTH;
                dn_last_mask = ((_y!=_ymax))?0xFF:(0xFF>>(8-(ystep)%8));
                dn_last_rshift = DN_YSPLIT%8+1+(8-ystep%8);
                for (_x=0; _x<SCREEN_WIDTH; _x++) {
                    unsigned int val = ((src_y<((SCREEN_HEIGHT/8)-1))?(screen_framebuffer[idx+_x+SCREEN_WIDTH]<<16):0) | (screen_framebuffer[idx+_x]<<8) | ((src_y>0)?(screen_framebuffer[idx+_x-SCREEN_WIDTH]):0) ;
                    unsigned int v = (val>>(dn_last_rshift))&dn_last_mask;
                    if (_y == up_last_y) {
                      v |= (val>>(up_last_rshift))&up_last_mask;
                    }
                    lcd_write(v);
                }
            }
            up_last_y = _ymin;


            // part with y>=ysplit is slided with a -dy speed
#define UP_YSPLIT (YSPLIT)
            ystep = (SCREEN_HEIGHT-UP_YSPLIT)*(uwTick-start_ms)/ANIM_DURATION_MS;
            _ymin = SCREEN_HEIGHT/8-((ystep/8)+1); 
            // number of page of 8 lines to be modified for the current step
            for (_y=SCREEN_HEIGHT/8-1; _y>=_ymin; _y--) { 
                lcd_control(0xB0|_y);              // <- page address
                unsigned int src_y = UP_YSPLIT/8+1/*(UP_YSPLIT%8?1:0)*/+(_y-_ymin-1);
                unsigned int idx = src_y*SCREEN_WIDTH;
                up_last_mask = ((_y!=_ymin))?0xFF:(0xFF<<(8-(ystep)%8));
                up_last_rshift = UP_YSPLIT%8+1+ystep%8;
                for (_x=0; _x<SCREEN_WIDTH; _x++) {
                    unsigned int val = ((src_y<((SCREEN_HEIGHT/8)-1))?(screen_framebuffer[idx+_x+SCREEN_WIDTH]<<16):0) | (screen_framebuffer[idx+_x]<<8) | ((src_y>0)?(screen_framebuffer[idx+_x-SCREEN_WIDTH]):0) ;
                    unsigned int v = (val>>(up_last_rshift))&up_last_mask;
                    if (_y == dn_last_y) {
                      v |= (val>>(dn_last_rshift/*+8*/))&dn_last_mask;
                    }
                    lcd_write(v);
                }
            }
            up_last_y = _ymin;
        }
        
        //screen_animation_ongoing = 0;
        
        // perform a last screen update to ensure no step missed (even if the animation speed is too fast)
        screen_update();
        break;
      }
  }
}

void screen_clear(void) {
  memset(screen_framebuffer, 0, sizeof(screen_framebuffer)); 
  screen_changed = 1;
}

int screen_draw_x;
int screen_draw_y;
unsigned int screen_draw_width;
unsigned int screen_draw_height;
int screen_draw_YX;
int screen_draw_YXlinemax;
int screen_draw_Ybitmask;
unsigned int* screen_draw_colors;

