LedgerHQ/nanos-nonsecure-firmware/build/stm32f042_nanos_seproxyhal/src/GLO091_SSD1306_screen.c
void bagl_hal_draw_bitmap_within_rect_internal(unsigned int bit_per_pixel, const unsigned char* bitmap, unsigned int bitmap_length_bits) {
  unsigned int i;
  int xx;  
  //unsigned int pixel_mask = (1<<bit_per_pixel)-1;
  #define pixel_mask 1 // 2 colors only

  int x = screen_draw_x;
  xx = x;
  int y = screen_draw_y;
  unsigned int width = screen_draw_width;
  unsigned int height = screen_draw_height;
  int YX = screen_draw_YX;
  int YXlinemax = screen_draw_YXlinemax;
  int Ybitmask = screen_draw_Ybitmask;
  unsigned int* colors = screen_draw_colors;

  screen_changed=1;

  while(bitmap_length_bits) {
    // horizontal scan transformed into vertical
    unsigned int ch = *bitmap++;
    // draw each pixel (at most 256 index color bitmap support)
    for (i = 0; i < 8 && bitmap_length_bits; bitmap_length_bits -= bit_per_pixel, i += bit_per_pixel) {

      // grab LSB to MSB bits
      // 2 colors only
      // bit    colorsarray     painted
      // 0      [0]=0               0
      // 1      [1]=0               0
      // 0      [0]=1               1
      // 1      [1]=1               1
      // 
      if (y>=0 && xx>=0) { // else we're out of screen
        if (colors[((ch>>i) & pixel_mask)] != 0) {
          screen_framebuffer[YX] |= Ybitmask;
        }
        else {
          screen_framebuffer[YX] &= ~Ybitmask;
        }
      }

      xx++;
      YX++;
      if (YX >= YXlinemax) {
        y++;
        height--;
        // update fast bit operation variables
        YX = (y/8)*SCREEN_WIDTH + x;
        xx = x;
        YXlinemax = YX + width;
        Ybitmask = 1<<(y%8);
      }

      if (height == 0) {
        goto end;
      }
    }
  }

  // save for continue
end:
  screen_draw_x = x;
  screen_draw_y = y;
  screen_draw_width = width;
  screen_draw_height = height;
  screen_draw_YX = YX;
  screen_draw_YXlinemax = YXlinemax;
  screen_draw_Ybitmask = Ybitmask;
  return;
}

void bagl_hal_draw_bitmap_within_rect(int x, int y, unsigned int width, unsigned int height, unsigned int color_count, const unsigned int *colors, unsigned int bit_per_pixel, const unsigned char* bitmap, unsigned int bitmap_length_bits) {

  // horizontal scan
  if (x>= SCREEN_WIDTH || y >= SCREEN_HEIGHT) {
    return;
  }

  if (x+width > SCREEN_WIDTH) {
    width = SCREEN_WIDTH-x;
  }

  if (y+height > SCREEN_HEIGHT) {
    height = SCREEN_HEIGHT-y;
  }

  int YX = (y/8)*SCREEN_WIDTH + x;
  int Ybitmask = 1<<(y%8); 
  int YXlinemax = YX + width;

  // run bitmap draw
  screen_draw_x = x;
  screen_draw_y = y;
  screen_draw_width = width;
  screen_draw_height = height;
  screen_draw_YX = YX;
  screen_draw_YXlinemax = YXlinemax;
  screen_draw_Ybitmask = Ybitmask;
  screen_draw_colors = colors;
  bagl_hal_draw_bitmap_within_rect_internal(bit_per_pixel, bitmap, bitmap_length_bits);
}

void bagl_hal_draw_bitmap_continue(unsigned int bit_per_pixel, const unsigned char* bitmap, unsigned int bitmap_length_bits) {
  bagl_hal_draw_bitmap_within_rect_internal(bit_per_pixel, bitmap, bitmap_length_bits);
}

// draw a simple rect
void bagl_hal_draw_rect(unsigned int color, int x, int y, unsigned int width, unsigned int height) {
  unsigned int i;

  if (x+width > SCREEN_WIDTH || x < 0) {
    return;
  }
  if (y+height > SCREEN_HEIGHT || y < 0) {
    return;
  }

  unsigned int YX = (y/8)*SCREEN_WIDTH + x;
  unsigned int Ybitmask = 1<<(y%8); 
  unsigned int YXlinemax = YX + width;

  screen_changed=1;

  i = width*height;
  while(i--) {
    // 2 colors only
    if (color) {
      screen_framebuffer[YX] |= Ybitmask;
    }
    else {
      screen_framebuffer[YX] &= ~Ybitmask;
    }

    YX++;
    if (YX >= YXlinemax) {
      y++;
      height--;
      // update fast bit operation variables
      YX = (y/8)*SCREEN_WIDTH + x;
      YXlinemax = YX + width;
      Ybitmask = 1<<(y%8);
    }

    if (height == 0) {
      break;
    }
  }
}

#ifdef HAVE_PRINTF
void screen_printc(const char ch) {

  if (newline_requested) {
    newline_requested=0;
    current_x=0;
    // rotate n-1 line
    memmove(screen_charbuffer, ((char*)screen_charbuffer)+PRINTF_LINE_CHAR_LENGTH, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH);
    // erase last line
    memset(((char*)screen_charbuffer)+PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH,' ', PRINTF_LINE_CHAR_LENGTH);

    //bagl_hal_draw_rect(0xF9F9F9, 0, SCREEN_HEIGHT- PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT);
    // redraw the whole zone (all chars are printed, no problem with)
    /*
    bagl_draw_string(PRINTF_FONT_ID, 
                   0x000000,
                   0xF9F9F9,
                   0, SCREEN_HEIGHT-PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT,
                   screen_charbuffer, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT,
                   BAGL_ENCODING_LATIN1);
    */
  }

  if(ch==0xA){
    // don't move screen yet, upon next print yes
    newline_requested = 1;

    // refresh surface
    // useless // bagl_hal_draw_rect(0xF9F9F9, 0, SCREEN_HEIGHT- PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT);
    bagl_draw_string(PRINTF_FONT_ID, 
                   0x000000,
                   0xF9F9F9,
                   0, SCREEN_HEIGHT-PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT,
                   screen_charbuffer, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT,
                   BAGL_ENCODING_LATIN1);
  }
  else if(ch=='\r') {
    // erase last line (but don't move text around)
    memset(((char*)screen_charbuffer)+PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH,' ', PRINTF_LINE_CHAR_LENGTH);
  }
  else if (ch >= 0x20 && ch <= 0x7F) {
    // always write at the bottom of the screen
    screen_charbuffer[PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT-PRINTF_LINE_CHAR_LENGTH+current_x] = ch;
    current_x++;
    if (current_x >= PRINTF_LINE_CHAR_LENGTH-1) {
      newline_requested = 1;
    }
  }

  /*
  // rotate n-1 line
  memmove(screen_charbuffer, ((char*)screen_charbuffer)+1, sizeof(screen_charbuffer)-1);
  // erase last line
  screen_charbuffer[sizeof(screen_charbuffer)-1] = ch;
  if (ch == '\n') {
    bagl_hal_draw_rect(0xF9F9F9, 0, SCREEN_HEIGHT- PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT);
    bagl_draw_string(PRINTF_FONT_ID, 
                   0x000000,
                   0xF9F9F9,
                   0, SCREEN_HEIGHT-PRINTF_ZONE_HEIGHT, SCREEN_WIDTH, PRINTF_ZONE_HEIGHT,
                   screen_charbuffer, PRINTF_LINE_CHAR_LENGTH*PRINTF_LINE_COUNT,
                   BAGL_ENCODING_LATIN1);
  }
  */

